cask_args appdir: '/Applications'

# Delivery
brew "aws-elasticbeanstalk"
brew "awscli"
tap "heroku/brew"
brew "heroku"
brew "kubernetes-cli"
brew "minikube"
# brew "hyperkit" # Uncomment if no "Docker Desktop"

# IDEs
brew "neovim"

# Security
brew "gnupg@1.4"
brew "openssl@1.1"

# Databases
brew "postgresql"
brew "rabbitmq"
brew "redis"
brew "sqlite"

# Bundlers
brew "cmake"
brew "composer"
brew "yarn"

# Languages and Frameworks
tap "amberframework/amber"
brew "amber"
brew "elixir"
brew "pip"

# Command Line Tools
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "fzf"
brew "git"
brew "git-quick-stats"
brew "graphviz"
brew "hub"
brew "jq"
brew "scons"
brew "tree"
tap "joshuaclayton/formulae"
brew "unused"

# Apps
cask "slack"
cask "virtualbox"
cask "gramps"
cask "evernote"
cask "dashlane"
cask "iterm2"
cask "udeler"
cask "google-chrome"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "staruml"
cask "transmission"
