cask_args appdir: '/Applications'

# Delivery
tap "heroku/brew"
brew "heroku"

# IDEs
brew "neovim"
brew "ctags-exuberant"

# Security
brew "gnupg@1.4"
brew "openssl@1.1"

# Databases
brew "postgresql"
brew "rabbitmq"
brew "redis"
brew "sqlite"

# Bundlers
brew "cmake"
brew "composer"
brew "yarn"

# Languages and Frameworks
brew "elixir"
brew "elm"
brew "gradle"

# Command Line Tools
brew "fzf"
brew "gh"
brew "git"
brew "git-quick-stats"
brew "graphviz"
brew "jq"
brew "the_silver_searcher"
brew "tree"
brew "wtfutil"
brew "bitwarden-cli"

# Apps
cask "google-chrome"
cask "gramps"
cask "iterm2"
cask "slack"
cask "staruml"
cask "transmission"
