# Delivery
brew "aws-elasticbeanstalk"
brew "awscli"
tap "heroku/brew"
brew "heroku"
brew "kubernetes-cli"

# IDEs
brew "neovim"

# Security
brew "gnupg@1.4"
brew "openssl@1.1"

# Databases
brew "postgresql"
brew "rabbitmq"
brew "redis"
brew "sqlite"
tap "timescale/tap"
brew "timescaledb"

# Bundlers
brew "cmake"
brew "composer"
brew "yarn"

# Languages and Frameworks
tap "amberframework/amber"
brew "amber"
brew "elixir"

# Command Line Tools
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "fzf"
brew "git"
brew "git-quick-stats"
brew "graphviz"
brew "hub"
brew "jq"
brew "scons"
brew "tree"
tap "joshuaclayton/formulae"
brew "unused"
